export const data = [
  {
    id: 1,
    title: "Авторизированный дилер CASIO",
    desc: "Наша компания официально сотрудничает с CASIO, а это значит гарантия качества, рекомендованные цены от завода, а также официальная мировая гарантия на 2 года.",
  },
  {
    id: 2,
    title: "Оплата после получения и примерки",
    desc: "Комфорт и удобство наших клиентов превыше всего. Сначала примерьте изделия, убедитесь, что они вам подходят, а оплату можно произвести позже.",
  },
  {
    id: 3,
    title: "Бесплатная доставка",
    desc: "Бесплатная доставка по Бишкеку, а также по всем регионам Кыргызстана для наших клиентов. Мы покроем расходы на доставку часов к вам.",
  },
];
