import { Newsletter } from "components";
import styles from "../styles/pages/Policy.module.scss";

export const Policy: React.FC = () => {
  return (
    <div className={styles.container}>
      <h2>Политика конфиденциальности</h2>
      <h3>1. Общая информация о сборе персональных данных.</h3>
      <h4>
        Компания «Бишкек Стар Компани» (далее «Casio Store») очень серьезно
        относится к защите Ваших персональных данных. Настоящая политика
        конфиденциальности данных описывает, как компания Casio Store (далее
        «мы», «нас» и «наш») использует и защищает данные, собранные через сайт
        (далее «веб-сайт»).
      </h4>
      <h4>
        Личными данными являются все данные, которые могут иметь отношение к Вам
        лично, например, ваше имя, ваш адрес, адрес электронной почты, номер
        телефона, банковские реквизиты, номера кредитной карты, IP-адрес и т.д.
      </h4>
      <h4>
        Ваши персональные данные собираются и обрабатываются нами только в
        соответствии с положениями Положения о защите данных Кыргызской
        Республики и другими положениями действующего национального
        законодательства о защите данных.
      </h4>
      <h4>
        Сбор и обработка персональных данных осуществляется на регулярной основе
        только с Вашего согласия или если обработка таких данных разрешена
        положениями законодательства. Следующие положения предоставляют Вам
        информацию о характере, объеме и цели сбора и обработки Ваших
        персональных данных.
      </h4>
      <h4>
        Если для выполнения отдельных функций нашего предложения и/или наших
        услуг мы обращаемся к уполномоченным поставщикам услуг или используем
        ваши данные в рекламных или аналитических целях, то ниже мы
        дополнительно предоставляем вам подробную информацию о соответствующих
        процедурах. На этом этапе мы также информируем Вас об определенных
        критериях и сроках хранения. Кроме того, мы информируем Вас о Ваших
        правах в отношении каждого случая обработки данных.
      </h4>
      <h4>
        Настоящая Политика конфиденциальности относится исключительно к нашему
        сайту. В случае, если вы переходите по ссылкам с нашего сайта на сайты
        третьих лиц, пожалуйста, обратитесь к этим сайтам за информацией о том,
        как они обращаются с вашими данными.
      </h4>
      <h3>2. Контакты</h3>
      <h4>
        Если у Вас возникли вопросы, предложения или критика в отношении защиты
        данных нашего веб-сайта, пожалуйста, свяжитесь с нами:
      </h4>
      <h4>
        <p>ОсОО «Бишкек Стар Компани»</p>
        <p>Адрес: Бизнес-центр «Премиум»</p>
        <p>ул. Токтогула 110</p>
        <p>Бишкек, Кыргызстан</p>
      </h4>
      <h3>3. Ваши права</h3>
      <h4>
        Как субъект данных, Вы можете иметь следующие права в отношении компании
        Casio Store. Для осуществления Ваших прав, пожалуйста, свяжитесь с нами,
        как указано в Разделе 2.
      </h4>
      <h4>
        <b>1. Право доступа в отношении обработки.</b>
        <br />
        Вы можете в рамках закона запросить у нас информацию о том,
        обрабатываются ли нами личные данные. В этом случае вы имеете право
        запросить информацию о степени обработки данных. Информация о доступе
        включает в себя, в частности, цели обработки, категории соответствующих
        персональных данных, а также получателей или категории получателей,
        которым были или будут переданы персональные данные. Вы можете иметь
        право на получение копии персональных данных, подвергающихся обработке.
        Однако это не является абсолютным правом, и интересы других лиц могут
        ограничить ваше право на получение такой копии.
      </h4>
      <h4>
        <b>2. Право на исправление («Право быть забытым»).</b>
        <br />
        Вы можете иметь право на исправление Ваших данных Компанией Casio Store,
        если обработанные персональные данные, касающиеся Вас, являются
        неверными. В зависимости от целей обработки вы можете иметь право на
        заполнение неполных личных данных, в том числе путем предоставления
        дополнительного заявления.
      </h4>
      <h4>
        <b>3. Право на ограничение обработки.</b>
        <br />
        Если для этого существуют предпосылки, Вы можете запросить ограничение
        на обработку Ваших персональных данных. В этом случае соответствующие
        данные будут помечены и могут быть обработаны нами только для
        определенных целей.
      </h4>
      <h4>
        <b>4. Право на удаление.</b>
        <br />
        При определенных обстоятельствах вы можете иметь право на получение от
        нас разрешения на стирание личных данных, касающихся вас, и мы можем
        быть обязаны удалить такие личные данные. Такое право на стирание, не
        применяется, если в случае неавтоматизированной обработки стирание было
        бы невозможно или потребовало бы несоразмерных усилий в связи с
        конкретным режимом хранения и если Ваш интерес к стиранию можно считать
        минимальным. В таком случае вы можете иметь право на ограничение
        обработки.
      </h4>
      <h4>
        <b>5. Право на портативность данных.</b>
        <br />
        При определенных обстоятельствах вы можете иметь право на получение
        касающихся вас персональных данных, которые вы предоставили компании BS,
        в структурированном, обычно используемом и машиночитаемом формате. Кроме
        того, вы имеете право беспрепятственно передавать эти данные другому
        контролеру от компании BS при условии наличия предварительных условий
        для этого.
      </h4>
      <h4>
        <b>5. Право на возражение.</b>
        <br />
        Вы имеете право в любое время по причинам, вытекающим из Вашей
        конкретной ситуации, подать протест против обработки касающихся Вас
        персональных данных. Следствием Вашего возражения является то, что
        компания BS больше не будет обрабатывать Ваши персональные данные, если
        она не сможет доказать веские причины, заслуживающие защиты при
        обработке, которые преобладают над Вашими интересами, правами и
        свободами, или если обработка служит для предъявления, осуществления или
        защиты юридических претензий. В случае, если мы осуществляем маркетинг в
        отношении Вас, Вы имеете право в любое время подать протест против
        обработки Ваших персональных данных в таких рекламных целях. Вы можете
        сообщить нам о своем возражении, используя следующие контактные данные:
      </h4>
      <Newsletter />
    </div>
  );
};
